//В этом ката вам нужно просто определить, является ли данный год високосным или нет. Если вы не знаете правил, вот они:
//
// Годы, кратные 4, являются високосными,
// но годы, кратные 100, не являются високосными,
// но годы, делящиеся на 400, являются високосными.
// Годы испытаний находятся в пределах допустимого 1600 ≤ year ≤ 4000.

function isLeapYear(year) {
    return year % 400 === 0 || (year % 4 === 0 && year % 100 !== 0);
}


console.log(isLeapYear(2000));
console.log(isLeapYear(2015));
console.log(isLeapYear(2100));
console.log(isLeapYear(2020));
