//Совершенное число — это число, у которого сумма делителей (кроме самого себя) равна самой себе.
//
// Напишите функцию, которая может проверять, nявляется ли данное целое число совершенным числом, и возвращать, Trueесли это так, или возвращать, Falseесли нет.
//
// Примеры
// n = 28имеет следующие делители:1, 2, 4, 7, 14, 28
//
// 1 + 2 + 4 + 7 + 14 = 28следовательно, 28это идеальное число, поэтому вам следует вернутьсяTrue
//
// Другой пример:
//
// n = 25имеет следующие делители:1, 5, 25
//
// 1 + 5 = 6следовательно 25, это не идеальное число, поэтому вам следует вернутьсяFalse

function isPerfect(n) {
    let value = 0;
    for (let i = 1; i < n; i++) {
        if( n % i === 0) {
            value += i;
        }
    }

    return value === n;
}


console.log(isPerfect(6));
